src/cf/Documents/ПодборКандидатаНаВакансию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПодборКандидатаНаВакансию</Name>
			<Comment>HRM</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПодбораКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/СостоянияПроверкиКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияПроверкиКандидатов</Name>
			<Comment>HRM</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пройдена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПройдена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ПодборКандидатаНаВакансию/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗапроситьПроверкуКандидатаВСБ(Команда)
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ЗапроситьПроверкуКандидатаВСБЗавершение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Документ будет записан. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗапроситьПроверкуКандидатаВСБНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапроситьПроверкуКандидатаВСБЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗапроситьПроверкуКандидатаВСБНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапроситьПроверкуКандидатаВСБНаСервере()
	
	ПодборПерсоналаHRM.СоздатьДокументПроверкаКандидатаСБПоДокументуОснованию(Объект.Ссылка);
	
	ЗаполнитьДанныеДокументаПроверкиСБ();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьДанныеДокументаПроверкиСБ();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДокументаПроверкиСБ()
	
	ДокументПроверкиСБ = ПодборПерсоналаHRM.ДокументПроверкиКандидатаСБПоДокументуОснованию(Объект.Ссылка);
	СостояниеПроверкиСБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПроверкиСБ, "СостояниеПроверки");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЕстьДокументПроверкиСБ = ЗначениеЗаполнено(Форма.ДокументПроверкиСБ);
	
	Элементы.ДокументПроверкиСБ.Видимость = ЕстьДокументПроверкиСБ;
	Элементы.СостояниеПроверкиСБ.Видимость = ЕстьДокументПроверкиСБ;
	Элементы.ЗапроситьПроверкуСлужбыБезопасности.Видимость = Не ЕстьДокументПроверкиСБ;
	
	Если ЕстьДокументПроверкиСБ Тогда
		Если Форма.СостояниеПроверкиСБ = ПредопределенноеЗначение("Перечисление.СостоянияПроверкиКандидатов.Пройдена") Тогда
			Элементы.ГруппаСостояниеПроверкиСБ.ЦветФона = WebЦвета.СветлоЗеленый;
		ИначеЕсли Форма.СостояниеПроверкиСБ = ПредопределенноеЗначение("Перечисление.СостоянияПроверкиКандидатов.НаПроверке") Тогда
			Элементы.ГруппаСостояниеПроверкиСБ.ЦветФона = WebЦвета.Золотой;
		Иначе
			Элементы.ГруппаСостояниеПроверкиСБ.ЦветФона = WebЦвета.СветлоКоралловый;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
